; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v2 ?v4)
             (pred_4 ?v8 ?v11)
             (pred_8 ?v2 ?v11)
             (pred_9 ?v9 ?v2 )
	     (pred_5 ?v2)
             (pred_1 ?v3)
             (pred_3 ?v8)
             (pred_2 ?v11)
             (pred_10 ?v2)
             (pred_11 ?v8)
             (pred_12 ?v2)
             (pred_6 ))



(:action op_2
:parameters (?v1 ?v13 ?v12 ?v10)
:precondition (and (pred_1 ?v1) (pred_1 ?v13) (pred_3 ?v12) (pred_2 ?v10)
          (pred_7 ?v1 ?v13) (pred_4 ?v12 ?v10)
                   (pred_8 ?v13 ?v10) (pred_5 ?v1) 
                   (pred_10 ?v13) (pred_11 ?v12))
:effect (and  (pred_12 ?v13) (not (pred_10 ?v13))))


(:action op_4
:parameters (?v1 ?v5)
:precondition (and (pred_1 ?v1) (pred_1 ?v5)
               (pred_5 ?v1) (pred_7 ?v1 ?v5) (pred_12 ?v5))
:effect (and (pred_5 ?v5) (not (pred_5 ?v1))))

(:action op_3
:parameters (?v1 ?v12)
:precondition (and (pred_1 ?v1) (pred_3 ?v12) 
                  (pred_5 ?v1) (pred_9 ?v12 ?v1) (pred_6 ))
:effect (and (pred_11 ?v12)
   (not (pred_9 ?v12 ?v1)) (not (pred_6 ))))


(:action op_1
:parameters (?v1 ?v6 ?v7)
:precondition (and (pred_1 ?v1) (pred_3 ?v6) (pred_3 ?v7)
                  (pred_5 ?v1) (pred_11 ?v7) (pred_9 ?v6 ?v1))
:effect (and (pred_11 ?v6) (pred_9 ?v7 ?v1)
        (not (pred_11 ?v7)) (not (pred_9 ?v6 ?v1))))

(:action op_5
:parameters (?v1 ?v12)
:precondition (and (pred_1 ?v1) (pred_3 ?v12) 
                  (pred_5 ?v1) (pred_11 ?v12))
:effect (and (pred_6 ) (pred_9 ?v12 ?v1) (not (pred_11 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_10 obj_05 obj_02 obj_18 obj_11 obj_13 obj_04 obj_19 obj_12 obj_09 obj_14 obj_06 obj_08 obj_01 obj_15 obj_07
    obj_16 obj_03
    obj_20 obj_17
    )

    (:init
       (pred_6)

       (pred_1 obj_10)
       (pred_1 obj_05)
       (pred_1 obj_02)
       (pred_1 obj_18)
       (pred_1 obj_11)
       (pred_1 obj_13)
       (pred_1 obj_04)
       (pred_1 obj_19)
       (pred_1 obj_12)
       (pred_1 obj_09)
       (pred_1 obj_14)
       (pred_1 obj_06)
       (pred_1 obj_08)
       (pred_1 obj_01)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_2 obj_16)
       (pred_2 obj_03)
       (pred_3 obj_20)
       (pred_3 obj_17)

       (pred_7 obj_10 obj_11)
       (pred_7 obj_10 obj_05)
       (pred_7 obj_05 obj_13)
       (pred_7 obj_05 obj_02)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_02 obj_04)
       (pred_7 obj_02 obj_18)
       (pred_7 obj_02 obj_05)
       (pred_7 obj_18 obj_19)
       (pred_7 obj_18 obj_02)
       (pred_7 obj_11 obj_12)
       (pred_7 obj_11 obj_13)
       (pred_7 obj_11 obj_10)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_13 obj_04)
       (pred_7 obj_13 obj_05)
       (pred_7 obj_13 obj_11)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_19)
       (pred_7 obj_04 obj_02)
       (pred_7 obj_04 obj_13)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_19 obj_18)
       (pred_7 obj_19 obj_04)
       (pred_7 obj_12 obj_08)
       (pred_7 obj_12 obj_09)
       (pred_7 obj_12 obj_11)
       (pred_7 obj_09 obj_01)
       (pred_7 obj_09 obj_14)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_12)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_14 obj_06)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_09)
       (pred_7 obj_06 obj_07)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_14)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_08 obj_12)
       (pred_7 obj_01 obj_15)
       (pred_7 obj_01 obj_09)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_15 obj_07)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_01)
       (pred_7 obj_07 obj_06)
       (pred_7 obj_07 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_05)
       (pred_8  obj_02 obj_16)
       (pred_8  obj_05 obj_03)
       (pred_12 obj_10)
       (pred_12 obj_18)
       (pred_12 obj_11)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_19)
       (pred_12 obj_12)
       (pred_12 obj_09)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_08)
       (pred_12 obj_01)
       (pred_12 obj_15)
       (pred_12 obj_07)

       (pred_4  obj_20 obj_16)
       (pred_4  obj_17 obj_03)
       (pred_9 obj_20 obj_04)
       (pred_9 obj_17 obj_06)
       (pred_5 obj_10)
    )

    (:goal (and
       (pred_9 obj_20 obj_08)
    ))
(:constraints
  (always (not (pred_5 obj_13)))
)
)

; plan
1. (op_4 obj_10 obj_11)
   deleted: (pred_5 obj_10)
   added: (pred_5 obj_11)
   goals met: 0 of 1
2. (op_4 obj_11 obj_12)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_12)
   goals met: 0 of 1
3. (op_4 obj_12 obj_09)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_09)
   goals met: 0 of 1
4. (op_4 obj_09 obj_14)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_14)
   goals met: 0 of 1
5. (op_4 obj_14 obj_04)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_04)
   goals met: 0 of 1
6. (op_3 obj_04 obj_20)
   deleted: (pred_9 obj_20 obj_04) (pred_6)
   added: (pred_11 obj_20)
   goals met: 0 of 1
7. (op_4 obj_04 obj_14)
   deleted: (pred_5 obj_04)
   added: (pred_5 obj_14)
   goals met: 0 of 1
8. (op_4 obj_14 obj_09)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_09)
   goals met: 0 of 1
9. (op_4 obj_09 obj_12)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_12)
   goals met: 0 of 1
10. (op_4 obj_12 obj_08)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_08)
   goals met: 0 of 1
11. (op_5 obj_08 obj_20)
   deleted: (pred_11 obj_20)
   added: (pred_6) (pred_9 obj_20 obj_08)
   goals met: 1 of 1
